Личный_помощник/src/InformationRegisters/ПоказанияСчетчиков/ПоказанияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказанияСчетчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Личный_помощник/src/InformationRegisters/ПоказанияСчетчиков/ManagerModule.bsl
Функция ПолучитьПоказанияСчетчиков(Знач Услуги = Неопределено, Знач Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияСчетчиков.Значение,
		|	ПоказанияСчетчиков.ВидУслуги
		|ИЗ
		|	РегистрСведений.ПоказанияСчетчиков.СрезПоследних(&Дата, ВидУслуги В (&Услуги)) КАК ПоказанияСчетчиков";
		
	Если Не ЗначениеЗаполнено(Услуги) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидУслуги В (&Услуги)", "");		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуги", Услуги);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
